<a href="https://colab.research.google.com/github/laisOmena/Machine-Learning/blob/master/Introdu%C3%A7%C3%A3o_a_Machine_Learning_e_Classifica%C3%A7%C3%A3o_4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

uri = "https://gist.githubusercontent.com/guilhermesilveira/4d1d4a16ccbf6ea4e0a64a38a24ec884/raw/afd05cb0c796d18f3f5a6537053ded308ba94bf7/car-prices.csv"
data = pd.read_csv(uri)
data.head()

   Unnamed: 0  mileage_per_year  model_year      price sold
0           0             21801        2000   30941.02  yes
1           1              7843        1998   40557.96  yes
2           2              7109        2006   89627.50   no
3           3             26823        2015   95276.14   no
4           4              7935        2014  117384.68  yes

In [2]:
a_trocar = {
    'no': 0,
    'yes': 1
}
data.sold = data.sold.map(a_trocar)
data.head()

   Unnamed: 0  mileage_per_year  model_year      price  sold
0           0             21801        2000   30941.02     1
1           1              7843        1998   40557.96     1
2           2              7109        2006   89627.50     0
3           3             26823        2015   95276.14     0
4           4              7935        2014  117384.68     1

In [3]:
from datetime import datetime

current_year = datetime.today().year

data['model_age'] = current_year - data.model_year
data.head()

   Unnamed: 0  mileage_per_year  model_year      price  sold  model_age
0           0             21801        2000   30941.02     1         19
1           1              7843        1998   40557.96     1         21
2           2              7109        2006   89627.50     0         13
3           3             26823        2015   95276.14     0          4
4           4              7935        2014  117384.68     1          5

In [4]:
data ['km_per_year'] = data.mileage_per_year * 1.60934
data.head()

   Unnamed: 0  mileage_per_year  model_year  ...  sold  model_age  km_per_year
0           0             21801        2000  ...     1         19  35085.22134
1           1              7843        1998  ...     1         21  12622.05362
2           2              7109        2006  ...     0         13  11440.79806
3           3             26823        2015  ...     0          4  43167.32682
4           4              7935        2014  ...     1          5  12770.11290

[5 rows x 7 columns]

In [5]:
data = data.drop(columns = ['Unnamed: 0', 'mileage_per_year', 'model_year'], axis = 1)
data.head()

       price  sold  model_age  km_per_year
0   30941.02     1         19  35085.22134
1   40557.96     1         21  12622.05362
2   89627.50     0         13  11440.79806
3   95276.14     0          4  43167.32682
4  117384.68     1          5  12770.11290

In [6]:
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.svm import LinearSVC
from sklearn.metrics import accuracy_score

x = data[["price", "model_age", "km_per_year"]]
y = data["sold"]

SEED = 5
np.random.seed(SEED)


train_x, test_x,train_y, test_y = train_test_split(x, y, stratify = y, test_size = 0.25)
print("treinamento com %d elementos e testaremos com %d elementos" %(len(train_x), len(test_x)))

model = LinearSVC()
model.fit(train_x, train_y)
predictions = model.predict(test_x)

hit_ratio = accuracy_score(test_y, predictions) * 100
print("A acurácia foi %.2f%%" % hit_ratio)

treinamento com 7500 elementos e testaremos com 2500 elementos
A acurácia foi 57.88%

/usr/local/lib/python3.6/dist-packages/sklearn/svm/base.py:929: ConvergenceWarning: Liblinear failed to converge, increase the number of iterations.
  "the number of iterations.", ConvergenceWarning)